$(function () {
    initcode();
})

var initcode = function () {
    var head = " <pre><code class=\"language-sql\" style=\"color:green\">";
    var text = "";
    text += "//                            _ooOoo_                              <br/>";
    text += "//                           o8888888o                             <br/>";
    text += "//                           88\" . \"88                           <br/>";
    text += "//                           (| -_- |)                             <br/>";
    text += "//                            O\\ = /O                             <br/>";
    text += "//                        ____/`---'\____                          <br/>";
    text += "//                      .   ' \\\\| |// `.                         <br/>";
    text += "//                       / \\\\||| : |||// \\                      <br/>";
    text += "//                     / _||||| -:- |||||- \\                      <br/>";
    text += "//                       | | \\\\\\ - /// | |                      <br/>";
    text += "//                     | \\_| ''\\---/'' | |                       <br/>";
    text += "//                      \\ .-\\__ `-` ___/-. /                     <br/>";
    text += "//                   ___`. .' /--.--\\ `. . __                     <br/>";
    text += "//              .\\\"\\\" '< `.___\\_<|>_/___.` >' \\\"\\\".       <br/>";
    text += "//               | | : `- \\`.;`\\ _ /`;.`/ - ` : | |              <br/>";
    text += "//                 \\ \\ `-. \\_ __\\ /__ _/ .-` / /               <br/>";
    text += "//         ======`-.____`-.___\\_____/___.-`____.-'======          <br/>";
    text += "//                            `=---='                              <br/>";
    text += "//                                                                 <br/>";
    text += "//         .............................................           <br/>";
    text += "//                  佛祖保佑             永无BUG                    <br/>";
    text += "//          佛曰:                                                  <br/>";
    text += "//                  写字楼里写字间，写字间里程序员；                 <br/>";
    text += "//                  程序人员写程序，又拿程序换酒钱。                 <br/>";
    text += "//                  酒醒只在网上坐，酒醉还来网下眠；                 <br/>";
    text += "//                  酒醉酒醒日复日，网上网下年复年。                 <br/>";
    text += "//                  但愿老死电脑间，不愿鞠躬老板前；                 <br/>";
    text += "//                  奔驰宝马贵者趣，公交自行程序员。                 <br/>";
    text += "//                  别人笑我忒疯癫，我笑自己命太贱；                 <br/>";
    text += "//                  不见满街漂亮妹，哪个归得程序员？                      ";
    var foot = " </code></pre>";
    $("#noticeContent").html(head + text + foot);
}